Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.ai.prompt.placeholder.readmeSegments
source: JSON batch of visible README blocks used for bilingual segmented translation.
ar: دفعة JSON من كتل README المرئية المستخدمة للترجمة المجزأة ثنائية اللغة.
de: JSON-Batch sichtbarer README-Blöcke für zweisprachige segmentierte Übersetzung.
es: Lote JSON de bloques visibles del README usados para traducción segmentada bilingüe.
fr: Lot JSON des blocs visibles du README utilisés pour la traduction segmentée bilingue.
id: Batch JSON blok README yang terlihat digunakan untuk terjemahan tersegmentasi dwibahasa.
it: Batch JSON di blocchi README visibili usati per la traduzione segmentata bilingue.
ja: バイリンガルセグメント翻訳に使用される、可視のREADMEブロックのJSONバッチ。
ko: 이중 언어 분할 번역에 사용되는 표시 가능한 README 블록의 JSON 배치.
nl: JSON-batch van zichtbare README-blokken gebruikt voor tweetalige gesegmenteerde vertaling.
pl: Partia JSON widocznych bloków README używana do dwujęzycznego tłumaczenia segmentowego.
pt_br: Lote JSON de blocos visíveis do README usados para tradução segmentada bilíngue.
ru: Пакет JSON видимых блоков README для двуязычного сегментированного перевода.
tr: İki dilli bölümlenmiş çeviri için kullanılan görünür README bloklarının JSON toplu işi.
uk: JSON-пакет видимих блоків README для двомовного сегментованого перекладу.
vi: Lô JSON các khối README hiển thị được sử dụng cho dịch thuật song ngữ theo phân đoạn.
zh_hans: 用于双语分段翻译的 README 可见文本块 JSON 批次。
zh_hant: 用於雙語分段翻譯的 README 可見文字區塊 JSON 批次。

# settings.ai.prompt.placeholder.readmeTextNodes
source: JSON batch of visible README text nodes used for translated-only full mode.
ar: دفعة JSON من عقد نص README المرئية المستخدمة لوضع الترجمة الكاملة فقط.
de: JSON-Batch sichtbarer README-Textknoten für übersetzungsnur-vollen Modus.
es: Lote JSON de nodos de texto visibles del README usados para el modo completo solo traducción.
fr: Lot JSON des nœuds de texte visibles du README utilisés pour le mode complet traduit uniquement.
id: Batch JSON node teks README yang terlihat digunakan untuk mode penuh hanya terjemahan.
it: Batch JSON di nodi di testo README visibili usati per la modalità completa solo traduzione.
ja: 翻訳のみのフルモードに使用される、可視のREADMEテキストノードのJSONバッチ。
ko: 번역 전용 전체 모드에 사용되는 표시 가능한 README 텍스트 노드의 JSON 배치.
nl: JSON-batch van zichtbare README-tekstknooppunten gebruikt voor alleen-vertaling volledige modus.
pl: Partia JSON widocznych węzłów tekstowych README używana do trybu pełnego tylko z tłumaczeniem.
pt_br: Lote JSON de nós de texto visíveis do README usados para o modo completo somente traduzido.
ru: Пакет JSON видимых текстовых узлов README для полного режима только перевода.
tr: Yalnızca çevrilmiş tam mod için kullanılan görünür README metin düğümlerinin JSON toplu işi.
uk: JSON-пакет видимих текстових вузлів README для повного режиму лише перекладу.
vi: Lô JSON các nút văn bản README hiển thị được sử dụng cho chế độ toàn phần chỉ dịch thuật.
zh_hans: 用于仅显示译文的全文模式的 README 可见文本节点 JSON 批次。
zh_hant: 用於僅顯示譯文的全文模式的 README 可見文字節點 JSON 批次。

# settings.ai.prompt.placeholder.repoTags
source: Tags already attached to this repository (comma-separated).
ar: العلامات المرفقة بالفعل بهذا المستودع (مفصولة بفواصل).
de: Bereits an dieses Repository angehängte Tags (kommagetrennt).
es: Etiquetas ya adjuntas a este repositorio (separadas por comas).
fr: Étiquettes déjà attachées à ce dépôt (séparées par des virgules).
id: Tag yang sudah dilampirkan ke repositori ini (dipisahkan koma).
it: Tag già associati a questo repository (separati da virgola).
ja: このリポジトリに既に付与されているタグ（カンマ区切り）。
ko: 이 저장소에 이미 첨부된 태그 (쉼표로 구분).
nl: Tags die al aan deze repository zijn gekoppeld (komma-gescheiden).
pl: Tagi już przypisane do tego repozytorium (oddzielone przecinkami).
pt_br: Tags já anexadas a este repositório (separadas por vírgula).
ru: Теги, уже прикреплённые к этому репозиторию (через запятую).
tr: Bu depoya zaten eklenmiş etiketler (virgülle ayrılmış).
uk: Теги, вже прикріплені до цього репозиторію (через кому).
vi: Thẻ đã được gắn vào kho lưu trữ này (phân cách bằng dấu phẩy).
zh_hans: 当前仓库已绑定的标签（逗号分隔）。
zh_hant: 當前倉庫已綁定的標籤（逗號分隔）。

# settings.ai.prompt.placeholder.summary
source: Cached AI summary markdown for this repository (empty when no summary has been generated).
ar: ملخص AI المخزن مؤقتًا بصيغة markdown لهذا المستودع (فارغ عندما لا يتم إنشاء ملخص).
de: Zwischengespeichertes KI-Zusammenfassungs-Markdown für dieses Repository (leer, wenn keine Zusammenfassung erstellt wurde).
es: Resumen de IA en markdown almacenado en caché para este repositorio (vacío cuando no se ha generado ningún resumen).
fr: Markdown du résumé IA mis en cache pour ce dépôt (vide si aucun résumé n'a été généré).
id: Markdown ringkasan AI yang di-cache untuk repositori ini (kosong jika belum ada ringkasan yang dibuat).
it: Markdown del riepilogo AI memorizzato nella cache per questo repository (vuoto quando nessun riepilogo è stato generato).
ja: このリポジトリのキャッシュされたAIサマリーマークダウン（サマリーが生成されていない場合は空）。
ko: 이 저장소의 캐시된 AI 요약 마크다운 (요약이 생성되지 않은 경우 비어 있음).
nl: In cache opgeslagen AI-samenvatting in markdown voor deze repository (leeg als er nog geen samenvatting is gegenereerd).
pl: Zbuforowane podsumowanie AI w Markdown dla tego repozytorium (puste, gdy nie wygenerowano podsumowania).
pt_br: Resumo em markdown da IA em cache para este repositório (vazio quando nenhum resumo foi gerado).
ru: Кэшированная AI-сводка в формате Markdown для этого репозитория (пусто, если сводка не была создана).
tr: Bu depo için önbelleğe alınmış AI özeti işaretleme dili (henüz özet oluşturulmamışsa boş).
uk: Кешований AI-підсумок у форматі markdown для цього репозиторію (порожній, якщо підсумок ще не створено).
vi: Markdown tóm tắt AI đã lưu trong bộ nhớ đệm cho kho lưu trữ này (trống khi chưa có tóm tắt nào được tạo).
zh_hans: 该仓库的缓存 AI 摘要 markdown（未生成过摘要时为空）。
zh_hant: 該倉庫的緩存 AI 摘要 markdown（未生成過摘要時為空）。

# settings.ai.prompt.placeholder.targetLanguage
source: Target language name (e.g. Simplified Chinese / English / Japanese), from the README pane language picker.
ar: اسم اللغة الهدف (مثل الصينية المبسطة / الإنجليزية / اليابانية)، من منتقي اللغة في جزء README.
de: Name der Zielsprache (z. B. Vereinfachtes Chinesisch / Englisch / Japanisch), aus dem Sprachauswahlfeld des README-Bereichs.
es: Nombre del idioma de destino (p. ej., Chino simplificado / Inglés / Japonés), del selector de idioma del panel README.
fr: Nom de la langue cible (ex. : chinois simplifié / anglais / japonais), provenant du sélecteur de langue du volet README.
id: Nama bahasa target (mis. Tionghoa Sederhana / Inggris / Jepang), dari pemilih bahasa panel README.
it: Nome della lingua di destinazione (es. Cinese semplificato / Inglese / Giapponese), dal selettore di lingua del pannello README.
ja: ターゲット言語名（例：簡体字中国語/英語/日本語）。READMEペインの言語ピッカーから取得。
ko: 대상 언어 이름 (예: 중국어 간체/영어/일본어), README 창 언어 선택기에서 가져옴.
nl: Doeltaalnaam (bijv. Vereenvoudigd Chinees / Engels / Japans), uit de taal kiezer van het README-deelvenster.
pl: Nazwa języka docelowego (np. chiński uproszczony / angielski / japoński), z selektora języka w panelu README.
pt_br: Nome do idioma de destino (ex.: Chinês Simplificado / Inglês / Japonês), do seletor de idioma do painel README.
ru: Название целевого языка (например, упрощённый китайский / английский / японский) из выбора языка панели README.
tr: Hedef dil adı (örn. Basitleştirilmiş Çince / İngilizce / Japonca), README bölmesi dil seçicisinden.
uk: Назва цільової мови (напр. спрощена китайська / англійська / японська) з вибору мови панелі README.
vi: Tên ngôn ngữ đích (ví dụ: Tiếng Trung Giản thể / Tiếng Anh / Tiếng Nhật), từ bộ chọn ngôn ngữ của ngăn README.
zh_hans: 当前目标语言名（如 Simplified Chinese / English / Japanese），由 README 面板上的语言选择器决定。
zh_hant: 當前目標語言名稱（如 Simplified Chinese / English / Japanese），由 README 面板上的語言選擇器決定。

# settings.ai.prompt.placeholder.topics
source: Topics list (comma-separated).
ar: قائمة الموضوعات (مفصولة بفواصل).
de: Themenliste (kommagetrennt).
es: Lista de temas (separados por comas).
fr: Liste des sujets (séparés par des virgules).
id: Daftar topik (dipisahkan koma).
it: Elenco degli argomenti (separati da virgola).
ja: トピック一覧（カンマ区切り）。
ko: 주제 목록 (쉼표로 구분).
nl: Onderwerpenlijst (komma-gescheiden).
pl: Lista tematów (oddzielona przecinkami).
pt_br: Lista de tópicos (separados por vírgula).
ru: Список тем (через запятую).
tr: Konular listesi (virgülle ayrılmış).
uk: Список тем (через кому).
vi: Danh sách chủ đề (phân cách bằng dấu phẩy).
zh_hans: topics 列表（逗号分隔）。
zh_hant: topics 列表（逗號分隔）。

# settings.ai.prompt.placeholders.footnote.chat
source: Note: the Chat task does not use the User Prompt template — user messages go directly to the model through the conversation messages array.
ar: ملاحظة: مهمة الدردشة لا تستخدم قالب موجه المستخدم — رسائل المستخدم تذهب مباشرة إلى النموذج عبر مصفوفة رسائل المحادثة.
de: Hinweis: Die Chat-Aufgabe verwendet nicht die Benutzer-Prompt-Vorlage – Benutzernachrichten gehen direkt über das Konversationsnachrichten-Array an das Modell.
es: Nota: la tarea Chat no usa la plantilla de Prompt de Usuario — los mensajes del usuario van directamente al modelo a través del array de mensajes de la conversación.
fr: Remarque : la tâche de chat n'utilise pas le modèle de prompt utilisateur — les messages de l'utilisateur sont envoyés directement au modèle via le tableau des messages de la conversation.
id: Catatan: tugas Chat tidak menggunakan template Prompt Pengguna — pesan pengguna langsung dikirim ke model melalui array pesan percakapan.
it: Nota: l'attività Chat non utilizza il modello Prompt Utente — i messaggi dell'utente vanno direttamente al modello attraverso l'array dei messaggi della conversazione.
ja: 注：チャットタスクはユーザープロンプトテンプレートを使用しません。ユーザーメッセージは会話メッセージ配列を通じて直接モデルに送信されます。
ko: 참고: 채팅 작업은 사용자 프롬프트 템플릿을 사용하지 않습니다. 사용자 메시지는 대화 메시지 배열을 통해 모델로 직접 전송됩니다.
nl: Opmerking: de Chat-taak gebruikt niet de gebruikersprompt-sjabloon — gebruikersberichten gaan rechtstreeks naar het model via de conversatieberichten-array.
pl: Uwaga: zadanie Czat nie używa szablonu Prompt użytkownika – wiadomości użytkownika są wysyłane bezpośrednio do modelu przez tablicę wiadomości konwersacji.
pt_br: Nota: a tarefa de Chat não usa o modelo de Prompt do Usuário — as mensagens do usuário vão diretamente para o modelo através do array de mensagens da conversa.
ru: Примечание: задача «Чат» не использует шаблон пользовательского запроса — сообщения пользователя отправляются напрямую модели через массив сообщений разговора.
tr: Not: Sohbet görevi Kullanıcı İstemi şablonunu kullanmaz — kullanıcı mesajları, konuşma mesajları dizisi aracılığıyla doğrudan modele gider.
uk: Примітка: завдання Chat не використовує шаблон User Prompt — повідомлення користувача надсилаються безпосередньо моделі через масив повідомлень розмови.
vi: Lưu ý: tác vụ Chat không sử dụng mẫu User Prompt — tin nhắn người dùng được gửi trực tiếp đến mô hình thông qua mảng tin nhắn hội thoại.
zh_hans: 说明：Chat 任务不使用 User Prompt 模板——用户消息直接通过对话 messages 数组传给模型。
zh_hant: 說明：Chat 任務不使用 User Prompt 模板——用戶消息直接通過對話 messages 數組傳給模型。

# settings.ai.prompt.placeholders.footnote.embedding
source: Note: the embedding API does not accept a system prompt — leaving the System Prompt field empty has no effect.
ar: ملاحظة: واجهة برمجة التطبيقات للتضمين لا تقبل موجه النظام — ترك حقل موجه النظام فارغًا ليس له أي تأثير.
de: Hinweis: Die Embedding-API akzeptiert keinen System-Prompt – das Leerlassen des System-Prompt-Felds hat keine Auswirkung.
es: Nota: la API de embedding no acepta un prompt del sistema — dejar el campo Prompt del Sistema vacío no tiene efecto.
fr: Remarque : l'API d'embedding n'accepte pas de prompt système — laisser le champ Prompt système vide n'a aucun effet.
id: Catatan: API embedding tidak menerima prompt sistem — membiarkan kolom Prompt Sistem kosong tidak berpengaruh.
it: Nota: l'API di embedding non accetta un prompt di sistema — lasciare vuoto il campo Prompt di Sistema non ha effetto.
ja: 注：埋め込みAPIはシステムプロンプトを受け付けません。システムプロンプトフィールドを空にしても効果はありません。
ko: 참고: 임베딩 API는 시스템 프롬프트를 허용하지 않습니다. 시스템 프롬프트 필드를 비워 두어도 효과가 없습니다.
nl: Opmerking: de embedding-API accepteert geen systeemprompt — het leeg laten van het systeemprompt-veld heeft geen effect.
pl: Uwaga: API osadzania nie akceptuje promptu systemowego – pozostawienie pola Prompt systemowy pustego nie ma wpływu.
pt_br: Nota: a API de embedding não aceita um prompt do sistema — deixar o campo Prompt do Sistema vazio não tem efeito.
ru: Примечание: API встраивания не принимает системный запрос — оставление поля «Системный запрос» пустым не имеет эффекта.
tr: Not: yerleştirme API'si bir sistem istemi kabul etmez — Sistem İstemi alanını boş bırakmanın bir etkisi yoktur.
uk: Примітка: API вбудовування не приймає системний запит — залишення поля System Prompt порожнім не має ефекту.
vi: Lưu ý: API nhúng không chấp nhận lời nhắc hệ thống — để trống trường System Prompt không có tác dụng.
zh_hans: 说明：embedding API 不接受 system prompt，系统提示词留空不会被使用。
zh_hant: 說明：embedding API 不接受 system prompt，系統提示詞留空不會被使用。

# settings.ai.prompt.placeholders.footnote.translation
source: Note: {targetLanguage} must appear in either prompt; the source-data placeholder for the selected mode belongs in the User Prompt.
ar: ملاحظة: يجب أن يظهر {targetLanguage} في أي من الموجهين؛ العنصر النائب لبيانات المصدر للوضع المحدد ينتمي إلى موجه المستخدم.
de: Hinweis: {targetLanguage} muss in einem der Prompts vorkommen; der Quelldaten-Platzhalter für den ausgewählten Modus gehört in den Benutzer-Prompt.
es: Nota: {targetLanguage} debe aparecer en cualquiera de los prompts; el marcador de datos fuente para el modo seleccionado pertenece al Prompt de Usuario.
fr: Remarque : {targetLanguage} doit apparaître dans l'un des prompts ; l'espace réservé des données source pour le mode sélectionné appartient au prompt utilisateur.
id: Catatan: {targetLanguage} harus muncul di salah satu prompt; placeholder data sumber untuk mode yang dipilih berada di Prompt Pengguna.
it: Nota: {targetLanguage} deve apparire in uno dei due prompt; il segnaposto dei dati sorgente per la modalità selezionata appartiene al Prompt Utente.
ja: 注：{targetLanguage} はどちらかのプロンプトに含める必要があります。選択したモードのソースデータプレースホルダーはユーザープロンプトに属します。
ko: 참고: {targetLanguage}는 두 프롬프트 중 하나에 나타나야 합니다. 선택한 모드의 소스 데이터 플레이스홀더는 사용자 프롬프트에 속합니다.
nl: Opmerking: {targetLanguage} moet in een van beide prompts voorkomen; de placeholder voor de bron-data van de geselecteerde modus hoort in de gebruikersprompt.
pl: Uwaga: {targetLanguage} musi wystąpić w jednym z promptów; placeholder danych źródłowych dla wybranego trybu należy do Promptu użytkownika.
pt_br: Nota: {targetLanguage} deve aparecer em um dos prompts; o placeholder de dados de origem para o modo selecionado pertence ao Prompt do Usuário.
ru: Примечание: {targetLanguage} должен присутствовать в одном из запросов; заполнитель исходных данных для выбранного режима должен находиться в пользовательском запросе.
tr: Not: {targetLanguage} istemlerden birinde bulunmalıdır; seçilen mod için kaynak veri yer tutucusu Kullanıcı İstemine aittir.
uk: Примітка: {targetLanguage} має бути присутнім в одному з запитів; заповнювач вихідних даних для вибраного режиму належить до User Prompt.
vi: Lưu ý: {targetLanguage} phải xuất hiện trong một trong hai lời nhắc; trình giữ chỗ dữ liệu nguồn cho chế độ đã chọn thuộc về User Prompt.
zh_hans: 说明：{targetLanguage} 必须出现在任一 Prompt 中；当前模式的源数据占位符应放在 User Prompt。
zh_hant: 說明：{targetLanguage} 必須出現在任一 Prompt 中；當前模式的源數據佔位符應放在 User Prompt。

# settings.ai.prompt.placeholders.note
source: Delete a placeholder from the prompt to skip injecting that data; use Restore Default if you break the template.
ar: احذف عنصرًا نائبًا من الموجه لتخطي حقن تلك البيانات؛ استخدم استعادة الافتراضي إذا أفسدت القالب.
de: Löschen Sie einen Platzhalter aus dem Prompt, um das Einfügen dieser Daten zu überspringen; verwenden Sie „Standard wiederherstellen“, wenn Sie die Vorlage beschädigen.
es: Elimina un marcador del prompt para omitir la inyección de esos datos; usa Restablecer valores predeterminados si rompes la plantilla.
fr: Supprimez un espace réservé du prompt pour éviter d'injecter ces données ; utilisez Restaurer les valeurs par défaut si vous cassez le modèle.
id: Hapus placeholder dari prompt untuk melewatkan penyuntikan data tersebut; gunakan Kembalikan Default jika Anda merusak template.
it: Elimina un segnaposto dal prompt per saltare l'iniezione di quei dati; usa Ripristina Predefiniti se rompi il modello.
ja: プロンプトからプレースホルダーを削除すると、そのデータの注入をスキップします。テンプレートを壊した場合は「デフォルトに戻す」を使用してください。
ko: 프롬프트에서 플레이스홀더를 삭제하면 해당 데이터 주입을 건너뜁니다. 템플릿을 망가뜨린 경우 기본값 복원을 사용하세요.
nl: Verwijder een placeholder uit de prompt om het injecteren van die data over te slaan; gebruik Standaard herstellen als u de sjabloon breekt.
pl: Usuń placeholder z promptu, aby pominąć wstrzykiwanie tych danych; użyj Przywróć domyślne, jeśli zepsujesz szablon.
pt_br: Exclua um placeholder do prompt para pular a injeção desses dados; use Restaurar Padrão se você quebrar o modelo.
ru: Удалите заполнитель из запроса, чтобы пропустить вставку этих данных; используйте «Восстановить по умолчанию», если вы нарушили шаблон.
tr: Bu verileri eklememek için istemden bir yer tutucuyu silin; şablonu bozarsanız Varsayılanı Geri Yükle'yi kullanın.
uk: Видаліть заповнювач із запиту, щоб пропустити вставку цих даних; використовуйте «Відновити стандартні», якщо ви зламали шаблон.
vi: Xóa trình giữ chỗ khỏi lời nhắc để bỏ qua việc chèn dữ liệu đó; sử dụng Khôi phục mặc định nếu bạn làm hỏng mẫu.
zh_hans: 从 prompt 里删掉占位符即不注入对应数据；改坏了点恢复默认按钮还原。
zh_hant: 從 prompt 裡刪掉佔位符即不注入對應數據；改壞了點恢復默認按鈕還原。

# settings.ai.prompt.placeholders.open
source: Placeholders
ar: العناصر النائبة
de: Platzhalter
es: Marcadores
fr: Espaces réservés
id: Placeholder
it: Segnaposto
ja: プレースホルダー
ko: 플레이스홀더
pl: Placeholdery
ru: Заполнители
tr: Yer tutucular
uk: Заповнювачі
vi: Trình giữ chỗ
zh_hans: 可用占位符
zh_hant: 可用佔位符

# settings.ai.prompt.placeholders.openHelp
source: Show placeholder names and meanings
ar: إظهار أسماء العناصر النائبة ومعانيها
de: Platzhalternamen und -bedeutungen anzeigen
es: Mostrar nombres y significados de los marcadores
fr: Afficher les noms et significations des espaces réservés
id: Tampilkan nama dan arti placeholder
it: Mostra nomi e significati dei segnaposto
ja: プレースホルダー名と意味を表示
ko: 플레이스홀더 이름과 의미 표시
nl: Toon placeholdernamen en -betekenissen
pl: Pokaż nazwy i znaczenia placeholderów
pt_br: Mostrar nomes e significados dos placeholders
ru: Показать названия и значения заполнителей
tr: Yer tutucu adlarını ve anlamlarını göster
uk: Показати назви та значення заповнювачів
vi: Hiển thị tên và ý nghĩa của trình giữ chỗ
zh_hans: 查看占位符名称与含义
zh_hant: 查看佔位符名稱與含義

# settings.ai.prompt.placeholders.title
source: Placeholder Reference
ar: مرجع العناصر النائبة
de: Platzhalter-Referenz
es: Referencia de marcadores
fr: Référence des espaces réservés
id: Referensi Placeholder
it: Riferimento Segnaposto
ja: プレースホルダーリファレンス
ko: 플레이스홀더 참조
nl: Placeholder-referentie
pl: Dokumentacja placeholderów
pt_br: Referência de Placeholders
ru: Справочник заполнителей
tr: Yer Tutucu Referansı
uk: Довідка щодо заповнювачів
vi: Tham chiếu trình giữ chỗ
zh_hans: 占位符说明
zh_hant: 佔位符說明

# settings.ai.prompt.restoreHelpFormat
source: Restore default prompt for %@
ar: استعادة الموجه الافتراضي لـ %@
de: Standard-Prompt für %@ wiederherstellen
es: Restablecer prompt predeterminado para %@
fr: Restaurer le prompt par défaut pour %@
id: Kembalikan prompt default untuk %@
it: Ripristina prompt predefinito per %@
ja: %@ のデフォルトプロンプトに戻す
ko: %@의 기본 프롬프트 복원
nl: Standaardprompt voor %@ herstellen
pl: Przywróć domyślny prompt dla %@
pt_br: Restaurar prompt padrão para %@
ru: Восстановить запрос по умолчанию для %@
tr: %@ için varsayılan istemi geri yükle
uk: Відновити стандартний запит для %@
vi: Khôi phục lời nhắc mặc định cho %@
zh_hans: 恢复 %@ 的默认 Prompt
zh_hant: 恢復 %@ 的默認 Prompt

# settings.ai.prompt.restoreHelpFormat %@
source: Restore default %@ Prompt
ar: استعادة موجه %@ الافتراضي
de: Standard-%@-Prompt wiederherstellen
es: Restablecer prompt predeterminado de %@
fr: Restaurer le prompt %@ par défaut
id: Kembalikan Prompt %@ Default
it: Ripristina prompt %@ predefinito
ja: %@ プロンプトをデフォルトに戻す
ko: 기본 %@ 프롬프트 복원
nl: Standaard %@-prompt herstellen
pl: Przywróć domyślny prompt %@
pt_br: Restaurar Prompt %@ padrão
ru: Восстановить запрос %@ по умолчанию
tr: Varsayılan %@ İstemini Geri Yükle
uk: Відновити стандартний запит %@
vi: Khôi phục lời nhắc %@ mặc định
zh_hans: 恢复默认 %@ Prompt
zh_hant: 恢復默認 %@ Prompt

# settings.ai.prompt.system
source: System Prompt
ar: موجه النظام
es: Prompt del sistema
fr: Prompt système
id: Prompt Sistem
it: Prompt di Sistema
ja: システムプロンプト
ko: 시스템 프롬프트
nl: Systeemprompt
pl: Prompt systemowy
pt_br: Prompt do Sistema
ru: Системный запрос
tr: Sistem İstemi
uk: Системний запит
vi: Lời nhắc hệ thống
zh_hans: 系统提示词
zh_hant: 系統提示詞

# settings.ai.prompt.system.embeddingUnavailable
source: Embedding APIs do not support system prompts.
ar: واجهات برمجة تطبيقات التضمين لا تدعم موجهات النظام.
de: Embedding-APIs unterstützen keine System-Prompts.
es: Las API de embedding no admiten prompts del sistema.
fr: Les API d'embedding ne prennent pas en charge les prompts système.
id: API embedding tidak mendukung prompt sistem.
it: Le API di embedding non supportano i prompt di sistema.
ja: 埋め込みAPIはシステムプロンプトをサポートしていません。
ko: 임베딩 API는 시스템 프롬프트를 지원하지 않습니다.
nl: Embedding-API's ondersteunen geen systeemprompts.
pl: API osadzania nie obsługują promptów systemowych.
pt_br: APIs de embedding não suportam prompts do sistema.
ru: API встраивания не поддерживают системные запросы.
tr: Yerleştirme API'leri sistem istemlerini desteklemez.
uk: API вбудовування не підтримують системні запити.
vi: API nhúng không hỗ trợ lời nhắc hệ thống.
zh_hans: Embedding API 不支持系统提示词。
zh_hant: Embedding API 不支持系統提示詞。

# settings.ai.prompt.task.pickerLabel
source: Task
ar: المهمة
de: Aufgabe
es: Tarea
fr: Tâche
id: Tugas
it: Attività
ja: タスク
ko: 작업
nl: Taak
pl: Zadanie
pt_br: Tarefa
ru: Задача
tr: Görev
uk: Завдання
vi: Tác vụ
zh_hans: 任务
zh_hant: 任務

# settings.ai.prompt.title
source: Prompt
ar: الموجه
ja: プロンプト
ko: 프롬프트
ru: Запрос
tr: İstem
uk: Запит
vi: Lời nhắc
zh_hans: 提示词
zh_hant: 提示詞

# settings.ai.prompt.translation.mode.pickerLabel
source: Translation prompt type
ar: نوع موجه الترجمة
de: Übersetzungs-Prompt-Typ
es: Tipo de prompt de traducción
fr: Type de prompt de traduction
id: Jenis prompt terjemahan
it: Tipo di prompt di traduzione
ja: 翻訳プロンプトタイプ
ko: 번역 프롬프트 유형
nl: Type vertaalprompt
pl: Typ promptu tłumaczenia
pt_br: Tipo de prompt de tradução
ru: Тип запроса перевода
tr: Çeviri istemi türü
uk: Тип запиту перекладу
vi: Loại lời nhắc dịch thuật
zh_hans: 翻译提示词类型
zh_hant: 翻譯提示詞類型

# settings.ai.prompt.user
source: User Prompt
ar: موجه المستخدم
de: Benutzer-Prompt
es: Prompt de usuario
fr: Prompt utilisateur
id: Prompt Pengguna
it: Prompt Utente
ja: ユーザープロンプト
ko: 사용자 프롬프트
nl: Gebruikersprompt
pl: Prompt użytkownika
pt_br: Prompt do Usuário
ru: Пользовательский запрос
tr: Kullanıcı İstemi
uk: Запит користувача
vi: Lời nhắc người dùng
zh_hans: 用户提示词
zh_hant: 用戶提示詞
